controllers/KasusTgrController.php

    public function actionGetsurat($id) {

        // $id = $_GET('id');

        if ($id == 'BMN Roda 2' | $id == 'BMN Roda 4') {

            if (Yii::$app->user->getIdentity()->level==5) {
            $rawSurat = MasterSurat::find()
                ->select('nama_surat')
                ->where(['level_kasus' => [1,3,4]])
                ->all();
            }else{
            $rawSurat = MasterSurat::find()
                ->select('nama_surat')
                ->where(['level_kasus' => [1,2,4]])
                ->all();
---
SELECT `nama_surat` FROM `master_surat` WHERE `level_kasus` IN (1, 2, 4)

                ->where(['level_kasus' => [1,3]])
                ->all();
            } else {
            $rawSurat = MasterSurat::find()
                ->select('nama_surat')
                ->where(['level_kasus' => [1,2]])
                ->all();
---
SELECT `nama_surat` FROM `master_surat` WHERE `level_kasus` IN (1, 2)

                ->where(['level_kasus' => [5,7,8]])
                ->all();
            }else{
            $rawSurat = MasterSurat::find()
                ->select('nama_surat')
                ->where(['level_kasus' => [5,6,8]])
                ->all();
---
SELECT `nama_surat` FROM `master_surat` WHERE `level_kasus` IN (5, 6, 8)