models/Satker.php

    public function getNamaSatkerById($kdsatker){
        $satker = self::find()
                ->select('nama_satker')
                ->where(array('kdsatker' => $kdsatker))
                ->scalar();
---
SELECT `nama_satker` FROM `satker` WHERE `kdsatker`='668596'